{
  "backend/main.mo": "Motoko backend actor defining feature requests, user profiles, announcements, assignments, and study tasks with access control and storage mixins.",
  "feature_evidence.json": "Feature evidence report describing a frontend change request and associated metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files for reference or tooling use.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color variables for light and dark themes with global styling.",
  "frontend/index.html": "Basic HTML shell loading the React app at #root.",
  "frontend/src/App.tsx": "Main React application wiring routes with TanStack Router and wrapping in ThemeProvider and Toaster.",
  "frontend/src/components/AssignmentChatbot.tsx": "Large chatbot component supporting multilingual assignment help, voice input/output, OCR, and downloadable responses.",
  "frontend/src/components/Layout.tsx": "App layout with header navigation, mobile drawer, routed outlet, and footer.",
  "frontend/src/components/StudentSathiAssistant.tsx": "Interactive assistant component handling messages, voice input, OCR via Tesseract, and assignment generation/confirmation flows.",
  "frontend/src/components/studyPlanner/SubjectBadge.tsx": "Renders a subject label with color styling based on subjectColorMapping.",
  "frontend/src/components/UserGuidelineDocument.tsx": "Empty component file with no implemented content.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor based on Internet Identity, recreating it on identity changes and invalidating related queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login/logout handling, and persistent identity loading using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for feature requests, assignment generation logic, conversation saving, and study planner mutations.",
  "frontend/src/hooks/useStudyPlannerSort.ts": "Stores and retrieves the study planner sort mode from localStorage.",
  "frontend/src/hooks/useStudyPlannerView.ts": "Persists and restores the study planner view mode (daily/weekly) using localStorage.",
  "frontend/src/index.css": "Tailwind CSS base theme with color variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AssignmentFormatPage.tsx": "Large UI page for creating formatted assignments with multilingual interface, settings, headings, and AI assistant integration.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing a hero section and a grid of navigation cards linking to various tools.",
  "frontend/src/pages/LeaveApplicationPage.tsx": "Provides a form for generating a formatted student leave application and supports copying the output.",
  "frontend/src/pages/NotesCleanerPage.tsx": "Cleans and formats rough notes into structured text with a simple processing UI and copy option.",
  "frontend/src/pages/RequestFeaturePage.tsx": "Form allowing users to submit feature requests with optional email, using a mutation hook.",
  "frontend/src/pages/ResumeBuilderPage.tsx": "Builds a simple text-based resume from user inputs including projects, with add/delete and copy features.",
  "frontend/src/pages/StudyPlannerPage.tsx": "Full-featured study planner supporting tasks, sorting, guest vs authenticated mode, and export utilities.",
  "frontend/src/utils/studyPlannerDuration.ts": "Parses duration strings into minutes and formats minute counts back into readable hour/minute strings.",
  "frontend/src/utils/studyPlannerGuestStorage.ts": "Manages guest-mode study tasks in localStorage, including loading, saving, adding, toggling completion, deleting, and clearing tasks.",
  "frontend/src/utils/studyPlannerPdfExport.ts": "Generates printable HTML for study tasks and opens it in a new window for PDF export via the browser print dialog.",
  "frontend/src/utils/studyPlannerSort.ts": "Provides deterministic sorting for tasks by date/time or by creation order using timestamps and IDs.",
  "frontend/src/utils/studyPlannerTaskDateTime.ts": "Converts date/time inputs to backend-friendly formats and formats stored date/time values for display.",
  "frontend/src/utils/studyPlannerTxtExport.ts": "Builds a plain-text export of study tasks with headers, summaries, and formatted task details, then downloads it as a TXT file.",
  "frontend/src/utils/subjectColorMapping.ts": "Maps subjects to predefined color names and returns associated badge and indicator CSS classes.",
  "frontend/src/utils/urlParams.ts": "Handles getting, storing, and clearing URL/session parameters, supporting both query and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom colors, animations, and typography/container-query plugins.",
  "project_state.json": "Tracks project requirements and state for adding a Daily progress bar feature to the Study Planner, including constraints and pending requests.",
  "unknown.txt": "Describes a fixed assignment editor format with download options, autosave, citation tools, and an embedded Student Sathi Assistant with specific UI and behavior rules."
}