{
  "backend/main.mo": "Motoko backend defining feature requests, user profiles, announcements, assignments, and study tasks with access control and storage mixins.",
  "feature_evidence.json": "JSON report mapping required UI features to source files, components, and test IDs with high-confidence evidence.",
  "frontend-file-summaries.txt": "Text file listing short descriptions of key frontend files and their functionality.",
  "frontend/index.css": "Global Tailwind-based OKLCH color theme and dark mode variables with base styling overrides.",
  "frontend/index.html": "Base HTML document that loads the root React app via main.tsx.",
  "frontend/src/App.tsx": "Application entry defining routes, theme provider, layout wrapper, and toast notifications.",
  "frontend/src/components/AssignmentChatbot.tsx": "Complex multilingual assignment assistant chatbot with text, voice, OCR, suggestions, and download capabilities.",
  "frontend/src/components/Layout.tsx": "Provides the main site layout with header navigation, mobile menu, routed content outlet, and footer.",
  "frontend/src/components/StudentSathiAssistant.tsx": "Implements an interactive assistant with messaging, voice input, OCR via Tesseract, and assignment generation logic.",
  "frontend/src/components/studyPlanner/SubjectBadge.tsx": "Renders a subject badge with color styling based on subject metadata.",
  "frontend/src/components/UserGuidelineDocument.tsx": "Empty placeholder component file.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, login, and stored identity handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for feature requests, assignment parsing, confirmation, conversation saving, and study planner actions.",
  "frontend/src/hooks/useStudyPlannerSort.ts": "Manages and persists the user’s study planner sort mode in localStorage.",
  "frontend/src/hooks/useStudyPlannerView.ts": "Manages and stores the study planner view preference (daily or weekly) in localStorage.",
  "frontend/src/index.css": "Sets up Tailwind CSS and defines light and dark theme CSS variables.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AssignmentFormatPage.tsx": "Provides a multi-language assignment formatting tool with title page inputs, formatting options, an editor, AI improvements, and download features.",
  "frontend/src/pages/HomePage.tsx": "Displays a hero section and grid of navigation cards linking to various student tools within the app.",
  "frontend/src/pages/LeaveApplicationPage.tsx": "Generates a formatted leave application letter based on user input and allows copying the result.",
  "frontend/src/pages/NotesCleanerPage.tsx": "Cleans and formats rough notes by capitalizing, punctuating, and spacing text, with copy functionality.",
  "frontend/src/pages/RequestFeaturePage.tsx": "Lets users submit feature requests with optional email, sending data via a mutation hook.",
  "frontend/src/pages/ResumeBuilderPage.tsx": "Builds a simple resume from user-provided details and projects, generating a text resume with copy support.",
  "frontend/src/pages/StudyPlannerPage.tsx": "Main Study Planner page handling task creation, filtering, sorting, guest mode, and authenticated tasks.",
  "frontend/src/utils/studyPlannerGuestStorage.ts": "Manages guest-mode study tasks using localStorage, including CRUD operations and ID handling.",
  "frontend/src/utils/studyPlannerPdfExport.ts": "Generates printable HTML for tasks and opens it for PDF export via the browser print dialog.",
  "frontend/src/utils/studyPlannerSort.ts": "Provides deterministic sorting for study tasks by date/time or default ID order.",
  "frontend/src/utils/studyPlannerTaskDateTime.ts": "Converts date/time inputs to backend formats and formats stored timestamps for display.",
  "frontend/src/utils/studyPlannerTxtExport.ts": "Exports study tasks to a plain-text file with summary and formatted task details.",
  "frontend/src/utils/subjectColorMapping.ts": "Maps subjects to consistent color names and returns corresponding badge and indicator CSS classes.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash-based), persist them in sessionStorage, and clear stored or hash-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the current UI‑only fix requirements for the study task list app, including layout rules, regressions, and architectural constraints.",
  "unknown.txt": "Lists features and UI behavior for an assignment editor system and embedded Student Sathi Assistant, including formatting, downloads, autosave, and chat UI rules."
}