{
  "backend/main.mo": "Motoko canister defining feature requests, user profiles, announcements, assignments, and study tasks with access control and storage mixins.",
  "feature_evidence.json": "Feature evidence report describing UI adjustments to specific Study Planner input fields and listing affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files outlining their roles across pages, components, hooks, and config.",
  "frontend/index.css": "Global Tailwind-based style definitions with OKLCH color tokens for light and dark themes.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, layout wrapper, and global toaster.",
  "frontend/src/components/AssignmentChatbot.tsx": "Full-featured assignment chatbot with multilingual UI, voice input/output, OCR image upload, and downloadable outputs.",
  "frontend/src/components/Layout.tsx": "App layout with sticky header navigation, mobile drawer, routed content outlet, and footer.",
  "frontend/src/components/StudentSathiAssistant.tsx": "React assistant component handling chat UI, voice input, OCR via Tesseract, and assignment-generation workflows using query hooks.",
  "frontend/src/components/studyPlanner/DailyProgressChart.nochange.md": "Notes that DailyProgressChart.tsx must remain unchanged because it already works correctly.",
  "frontend/src/components/studyPlanner/DailyProgressChart.tsx": "Displays a daily progress donut chart with stats computed from tasks including completed, pending, and total study time.",
  "frontend/src/components/studyPlanner/ProgressChartsSection.tsx": "Chooses between daily or weekly progress charts and renders the appropriate component with tasks.",
  "frontend/src/components/studyPlanner/SubjectBadge.tsx": "Renders a small colored badge for a subject using a mapped color class.",
  "frontend/src/components/studyPlanner/SubjectFilterDropdown.tsx": "Popover dropdown allowing users to search, filter, and select subjects with count indicators.",
  "frontend/src/components/studyPlanner/WeeklyProgressChart.tsx": "Displays a weekly progress donut chart summarizing completed, pending tasks, and total completed-study time.",
  "frontend/src/components/UserGuidelineDocument.tsx": "Empty or placeholder component file with no content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for initializing, storing, and managing Internet Identity authentication with AuthClient.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for feature requests, assignment generation, conversation saving, and study planner task creation, with some frontend-only logic.",
  "frontend/src/hooks/useStudyPlannerSort.ts": "Hook that stores and retrieves the study planner sort mode from localStorage.",
  "frontend/src/hooks/useStudyPlannerSubjectFilter.ts": "Hook managing separate daily/weekly subject filters with persistence in localStorage.",
  "frontend/src/hooks/useStudyPlannerView.ts": "Hook that persists and restores the selected study planner view mode.",
  "frontend/src/index.css": "Tailwind base styles plus CSS variables for theming in light and dark modes.",
  "frontend/src/main.tsx": "App entry point setting up React, React Query, Internet Identity, and global styles.",
  "frontend/src/pages/AssignmentFormatPage.tsx": "Large UI page for building formatted assignments with multilingual UI, editing tools, and export options.",
  "frontend/src/pages/HomePage.tsx": "Homepage listing all StudentSathi tools with navigation and a hero section.",
  "frontend/src/pages/LeaveApplicationPage.tsx": "Form-based page that generates a leave application letter and allows copying it.",
  "frontend/src/pages/NotesCleanerPage.tsx": "A React page that cleans rough notes by trimming, formatting, and capitalizing lines, then displays and allows copying the cleaned output.",
  "frontend/src/pages/RequestFeaturePage.tsx": "A form page where users submit feature requests with optional email, using a mutation hook and toast notifications.",
  "frontend/src/pages/ResumeBuilderPage.tsx": "A simple resume builder that gathers user info, projects, and skills to generate and copy formatted resume text.",
  "frontend/src/pages/StudyPlannerPage.tsx": "A complex study planner managing authenticated and guest tasks, with sorting, filtering, task creation, and progress features.",
  "frontend/src/utils/studyPlannerDuration.ts": "Utility functions to parse duration strings into minutes and format minutes back into human‑readable durations.",
  "frontend/src/utils/studyPlannerGuestStorage.ts": "LocalStorage-based CRUD utilities for guest-mode study tasks with auto-increment IDs and legacy task cleanup.",
  "frontend/src/utils/studyPlannerPdfExport.ts": "Generates printable HTML for study tasks and opens a new window to trigger browser PDF printing.",
  "frontend/src/utils/studyPlannerSort.ts": "Provides deterministic sorting for study tasks by date/time or creation order.",
  "frontend/src/utils/studyPlannerTaskDateTime.ts": "Converts and formats date/time inputs for tasks and outputs display-ready strings.",
  "frontend/src/utils/studyPlannerTxtExport.ts": "Builds a plain-text representation of study tasks and triggers a TXT file download.",
  "frontend/src/utils/studyPlannerWeek.ts": "Handles weekly date normalization, week boundaries, and checks for dates within the current week.",
  "frontend/src/utils/subjectColorMapping.ts": "Maps subjects to predefined color names and returns corresponding CSS classes for badges and indicators.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, and container settings and enabling typography, container-queries, and animation plugins.",
  "project_state.json": "Project state describing requirements to visually lighten specific form fields and tracking existing and new feature requests.",
  "unknown.txt": "Specification text defining a fixed assignment editor template with features like downloads, subject headings, citation helpers, autosave, and an embedded Student Sathi chat assistant."
}