{
  "backend/main.mo": "Motoko backend actor managing feature requests, user profiles, announcements, assignments, and study tasks with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report describing requirements and affected files for fixing weekly progress chart calculations.",
  "frontend-file-summaries.txt": "List of frontend files mapped to short functional summaries for documentation.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color tokens and theming variables for light and dark modes.",
  "frontend/index.html": "Root HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, theme provider, and toaster.",
  "frontend/src/components/AssignmentChatbot.tsx": "Multilingual assignment‑focused chatbot with text, voice, OCR input, and downloadable outputs.",
  "frontend/src/components/Layout.tsx": "Provides the main app layout with header navigation, mobile sidebar menu, content outlet, and footer.",
  "frontend/src/components/StudentSathiAssistant.tsx": "Implements an AI assistant UI with messaging, voice input, OCR support, and assignment-generation workflow.",
  "frontend/src/components/studyPlanner/DailyProgressChart.nochange.md": "Notes that the DailyProgressChart file should remain unchanged for the weekly chart fix.",
  "frontend/src/components/studyPlanner/DailyProgressChart.tsx": "Renders a daily progress donut chart and statistics computed from task completion and durations.",
  "frontend/src/components/studyPlanner/ProgressChartsSection.tsx": "Displays either the daily or weekly progress chart based on the selected view type.",
  "frontend/src/components/studyPlanner/SubjectBadge.tsx": "Shows a colored subject label using mapped subject color classes.",
  "frontend/src/components/studyPlanner/SubjectFilterDropdown.tsx": "Provides a searchable dropdown to filter tasks by subject with count display and selection handling.",
  "frontend/src/components/studyPlanner/WeeklyProgressChart.tsx": "Renders a weekly progress donut chart using tasks filtered to the current week with completion stats.",
  "frontend/src/components/UserGuidelineDocument.tsx": "Empty placeholder component file.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an authentication context using Internet Identity, managing identity loading, login, logout, and status states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for feature requests, assignment generation, conversation saving, and study planner task operations.",
  "frontend/src/hooks/useStudyPlannerSort.ts": "Stores and persists the study planner's sort mode in localStorage.",
  "frontend/src/hooks/useStudyPlannerSubjectFilter.ts": "Manages per-view subject filters for the study planner with persistence in localStorage.",
  "frontend/src/hooks/useStudyPlannerView.ts": "Handles the user's preferred study planner view (daily or weekly) with localStorage persistence.",
  "frontend/src/index.css": "Configures Tailwind layers and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AssignmentFormatPage.tsx": "Renders a multilingual assignment formatting tool with inputs, editor, settings, and download options.",
  "frontend/src/pages/HomePage.tsx": "Displays the main homepage with a hero section and navigation cards for all tools.",
  "frontend/src/pages/LeaveApplicationPage.tsx": "Page that generates a formatted student leave application letter based on name, date, and reason, with options to copy the output.",
  "frontend/src/pages/NotesCleanerPage.tsx": "Takes rough notes, cleans and formats them into readable text, and allows copying the result.",
  "frontend/src/pages/RequestFeaturePage.tsx": "Form for submitting feature requests with optional email, using a mutation hook to send the request.",
  "frontend/src/pages/ResumeBuilderPage.tsx": "Builds a simple resume from user inputs including projects, then generates and copies formatted resume text.",
  "frontend/src/pages/StudyPlannerPage.tsx": "Comprehensive study planner supporting tasks, filtering, sorting, persistence, guest mode, and exporting.",
  "frontend/src/utils/studyPlannerDuration.ts": "Utility functions to parse duration strings into minutes and format minutes back into readable durations.",
  "frontend/src/utils/studyPlannerGuestStorage.ts": "Manages guest-mode study tasks in localStorage, including loading, saving, creating, toggling, and deleting tasks.",
  "frontend/src/utils/studyPlannerPdfExport.ts": "Generates printable HTML for tasks and opens a new window for PDF-style printing.",
  "frontend/src/utils/studyPlannerSort.ts": "Provides deterministic sorting for tasks by date/time or by creation order using task IDs.",
  "frontend/src/utils/studyPlannerTaskDateTime.ts": "Converts and formats date/time input for tasks, handling bigint and number values safely.",
  "frontend/src/utils/studyPlannerTxtExport.ts": "Exports tasks as a plain-text Notepad-friendly file with headers, summaries, and formatted task details.",
  "frontend/src/utils/studyPlannerWeek.ts": "Handles weekly date calculations, normalizing task dates and determining week boundaries and day indices.",
  "frontend/src/utils/subjectColorMapping.ts": "Maps subjects to predefined color schemes and returns appropriate badge or indicator classes.",
  "frontend/src/utils/urlParams.ts": "Parses URL parameters, stores them in sessionStorage for persistence, and handles cleanup of hash-based params.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended theme colors, animations, and includes typography, container queries, and animate plugins.",
  "project_state.json": "Defines project metadata and detailed requirements for fixing weekly progress chart calculations using consistent task data and week-based filtering.",
  "unknown.txt": "Describes a fixed assignment editor template with features like subject insertion, downloads, autosave, and an embedded Student Sathi Assistant with strict UI behavior rules."
}