{
  "backend/main.mo": "Motoko backend actor handling feature requests, user profiles, announcements, assignments, and study tasks with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to their related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file listing concise summaries of all major frontend files and their purposes.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables and light/dark theme tokens for the entire frontend.",
  "frontend/index.html": "Base HTML document mounting the React app root and loading main.tsx.",
  "frontend/src/App.tsx": "Main React entry component configuring routes with TanStack Router, theme provider, and global toaster.",
  "frontend/src/components/AssignmentChatbot.tsx": "Large interactive assignment chatbot supporting multilingual input, voice/image processing, suggestions, and downloadable outputs.",
  "frontend/src/components/Layout.tsx": "Provides the main app layout with header navigation, responsive mobile menu, footer, and an outlet for routed content.",
  "frontend/src/components/StudentSathiAssistant.tsx": "Implements an AI assistant UI with messaging, voice input, OCR via Tesseract, auto‑scrolling, and assignment-generation workflow.",
  "frontend/src/components/studyPlanner/DailyProgressChart.tsx": "Renders a daily donut chart summarizing task completion stats and total study time.",
  "frontend/src/components/studyPlanner/ProgressChartsSection.tsx": "Switches between daily and weekly progress charts based on the selected view type.",
  "frontend/src/components/studyPlanner/SubjectBadge.tsx": "Displays a subject label styled with a color class determined by subject metadata.",
  "frontend/src/components/studyPlanner/SubjectFilterDropdown.tsx": "Provides a searchable dropdown for selecting subjects, showing counts and supporting 'All Subjects' selection.",
  "frontend/src/components/studyPlanner/WeeklyProgressChart.tsx": "Generates a weekly bar chart aggregating study hours per day from tasks and displaying totals.",
  "frontend/src/components/UserGuidelineDocument.tsx": "Empty placeholder component with no implemented content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing login state and identity loading. Wraps AuthClient creation and exposes login and logout helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for feature requests, assignment generation, conversation saving, and study planner task operations. Includes helpers for parsing assignment topics and confirming generation.",
  "frontend/src/hooks/useStudyPlannerSort.ts": "Manages and persists the study planner's sort mode using localStorage. Returns current sort mode and an updater function.",
  "frontend/src/hooks/useStudyPlannerSubjectFilter.ts": "Stores and restores subject filters for daily and weekly study planner views separately. Syncs changes to localStorage and returns the active filter with a setter.",
  "frontend/src/hooks/useStudyPlannerView.ts": "Handles persistence of the study planner's active view (daily or weekly). Loads from and saves to localStorage with a default of weekly.",
  "frontend/src/index.css": "Configures Tailwind CSS layers and defines light/dark theme CSS variables for UI styling. Applies global background, text, and border styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider. Renders the main App component.",
  "frontend/src/pages/AssignmentFormatPage.tsx": "Implements a multilingual assignment formatting tool with UI controls for metadata, formatting options, editing, and downloads. Includes translation sets and interactive editor features.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero content and a grid of tool cards linking to various app features. Uses navigation and UI components for layout and interaction.",
  "frontend/src/pages/LeaveApplicationPage.tsx": "React page that collects student details, generates a formatted leave application letter, and allows copying it.",
  "frontend/src/pages/NotesCleanerPage.tsx": "Cleans rough notes by formatting, capitalizing, and punctuating lines, then displays and allows copying the result.",
  "frontend/src/pages/RequestFeaturePage.tsx": "Form page for submitting feature requests with optional email, using a mutation hook to send data.",
  "frontend/src/pages/ResumeBuilderPage.tsx": "Simple resume builder that gathers personal info and projects, generates text output, and supports copying.",
  "frontend/src/pages/StudyPlannerPage.tsx": "Complex study planner managing tasks, filters, sorting, guest mode, and backend sync with various utilities.",
  "frontend/src/utils/studyPlannerDuration.ts": "Utility functions to parse duration strings into minutes and format minutes back into readable duration text.",
  "frontend/src/utils/studyPlannerGuestStorage.ts": "Manages guest-mode study tasks in localStorage, including loading, saving, creating, updating, and clearing tasks.",
  "frontend/src/utils/studyPlannerPdfExport.ts": "Generates printable HTML for tasks and opens it in a new window for PDF-style export.",
  "frontend/src/utils/studyPlannerSort.ts": "Provides deterministic sorting for tasks by date/time or by ID-based creation order.",
  "frontend/src/utils/studyPlannerTaskDateTime.ts": "Handles conversion and formatting of optional date/time fields for study tasks.",
  "frontend/src/utils/studyPlannerTxtExport.ts": "Builds a plain-text summary of tasks and triggers a downloadable TXT export.",
  "frontend/src/utils/subjectColorMapping.ts": "Defines subject-to-color mappings and returns the appropriate CSS classes for badges and indicators.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH color palette, container settings, animations, and typography/container-query/animation plugins.",
  "project_state.json": "Describes the project’s state and requirements for adding a Progress Charts section with daily and weekly charts using existing local task data.",
  "unknown.txt": "Outlines a fixed assignment-page template with editor features, download options, subject insertion, citations, checklist, and an embedded Student Sathi Assistant UI."
}