{
  "backend/main.mo": "Motoko canister implementing access control, user profiles, feature requests, announcements, assignments, and study planner task types with storage mixins.",
  "feature_evidence.json": "Feature evidence report listing two frontend feature fixes with affected files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Text file mapping numerous frontend file paths to concise functional descriptions.",
  "frontend/index.css": "Tailwind base/theme variables defining OKLCH color tokens and light/dark mode palette.",
  "frontend/index.html": "Basic HTML entry page mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, wraps app with ThemeProvider, and includes global Toaster.",
  "frontend/src/components/AssignmentChatbot.tsx": "Large multilingual assignment-assistant chatbot with voice, OCR, file handling, and downloadable output.",
  "frontend/src/components/Layout.tsx": "Top-level layout with header navigation, mobile drawer, routed content area, and footer.",
  "frontend/src/components/StudentSathiAssistant.tsx": "Large assistant UI component handling messages, voice input, OCR via Tesseract, and assignment generation workflows.",
  "frontend/src/components/studyPlanner/DailyProgressChart.nochange.md": "Notes that the DailyProgressChart.tsx file must remain unchanged for a weekly chart fix.",
  "frontend/src/components/studyPlanner/DailyProgressChart.tsx": "Renders a daily progress donut chart and stats based on completed and pending study tasks.",
  "frontend/src/components/studyPlanner/ProgressChartsSection.tsx": "Switches between daily and weekly progress chart components based on viewType.",
  "frontend/src/components/studyPlanner/SubjectBadge.tsx": "Displays a subject label styled using a mapped color class.",
  "frontend/src/components/studyPlanner/SubjectFilterDropdown.tsx": "Filter dropdown allowing selection and search of subjects with counts.",
  "frontend/src/components/studyPlanner/WeeklyProgressChart.tsx": "Renders a weekly progress donut chart and stats using only tasks from the current week.",
  "frontend/src/components/UserGuidelineDocument.tsx": "Empty placeholder file for a user guideline document component.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, auto-refreshing queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login handling, identity persistence, and status management.",
  "frontend/src/hooks/useQueries.ts": "Defines multiple React Query mutations for feature requests, assignment generation, conversation saving, and study planner task creation.",
  "frontend/src/hooks/useStudyPlannerSort.ts": "Provides a hook to store and retrieve the study planner's sort mode using localStorage.",
  "frontend/src/hooks/useStudyPlannerSubjectFilter.ts": "Implements separate daily and weekly subject filters persisted in localStorage.",
  "frontend/src/hooks/useStudyPlannerView.ts": "Stores and restores the selected study planner view mode (daily or weekly) via localStorage.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines extensive light and dark theme CSS variables.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AssignmentFormatPage.tsx": "Implements a full-featured assignment formatting UI with multilingual labels, editor controls, and export options.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section and navigation cards for all main tools.",
  "frontend/src/pages/LeaveApplicationPage.tsx": "Generates a leave application letter from user input and allows copying the output.",
  "frontend/src/pages/NotesCleanerPage.tsx": "Provides a UI to paste rough notes, auto‑clean and format them, and copy the cleaned output.",
  "frontend/src/pages/RequestFeaturePage.tsx": "Displays a form for users to submit feature requests with optional email, sending data via a mutation.",
  "frontend/src/pages/ResumeBuilderPage.tsx": "Lets users enter personal info and projects to generate a simple text‑based resume and copy it.",
  "frontend/src/pages/StudyPlannerPage.tsx": "Implements a full study‑task planner with auth/guest modes, task creation, filtering, sorting, progress tracking, and export.",
  "frontend/src/utils/studyPlannerDuration.ts": "Parses duration strings into minutes and formats minute values back into readable duration text.",
  "frontend/src/utils/studyPlannerGuestStorage.ts": "Manages study‑planner guest tasks using localStorage, including load, add, toggle, delete, and clear operations.",
  "frontend/src/utils/studyPlannerPdfExport.ts": "Generates printable HTML for Study Planner tasks and opens a browser print window for PDF export.",
  "frontend/src/utils/studyPlannerSort.ts": "Provides deterministic task sorting by date/time or creation order using timestamps and IDs.",
  "frontend/src/utils/studyPlannerTaskDateTime.ts": "Handles parsing and formatting of optional date and time fields for Study Planner tasks.",
  "frontend/src/utils/studyPlannerTxtExport.ts": "Creates a plain-text export of Study Planner tasks and triggers a file download.",
  "frontend/src/utils/studyPlannerWeek.ts": "Normalizes task dates and computes week boundaries and indices for weekly views.",
  "frontend/src/utils/subjectColorMapping.ts": "Maps subjects to predefined color names and CSS classes for badges and indicators.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom OKLCH color palette, extended utilities, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file describing versions, known issues, and two existing features related to fixing weekly progress chart behavior.",
  "unknown.txt": "Notes describing a fixed assignment editor template with formatting tools, download options, local saving, and a built‑in 'Student Sathi' assistant UI behavior."
}