{
  "backend/main.mo": "Motoko backend actor managing feature requests, user profiles, announcements, tasks, assignments, and authorization with storage mixins.",
  "feature_evidence.json": "JSON report listing feature IDs, descriptions, related files, components, tests, and confidence levels for implemented features.",
  "frontend-file-summaries.txt": "Text file containing short descriptive summaries for major frontend files and pages.",
  "frontend/index.css": "Tailwind-based global CSS defining theme variables, light/dark mode color tokens, and base styling.",
  "frontend/index.html": "HTML entry point loading the root div and bootstrapping the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring routing with TanStack Router, theme provider, and global toaster notifications.",
  "frontend/src/components/AssignmentChatbot.tsx": "Large multilingual assignment chatbot component with text, voice, OCR, suggestions, and downloadable content support.",
  "frontend/src/components/Layout.tsx": "Provides the main app layout with header navigation, responsive mobile menu, content outlet, and footer.",
  "frontend/src/components/StudentSathiAssistant.tsx": "Implements an AI assistant UI with messaging, speech recognition, OCR via Tesseract, and assignment-generation workflow.",
  "frontend/src/components/studyPlanner/SubjectBadge.tsx": "Renders a colored subject badge using subject-based color mapping.",
  "frontend/src/components/UserGuidelineDocument.tsx": "Empty placeholder component file.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading, login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for feature requests, assignment parsing/confirmation, saving conversations, and study planner tasks.",
  "frontend/src/hooks/useStudyPlannerSort.ts": "Manages and persists study planner sort mode in localStorage.",
  "frontend/src/hooks/useStudyPlannerView.ts": "Manages and persists the study planner view mode (daily/weekly) in localStorage.",
  "frontend/src/index.css": "Tailwind setup and CSS variables for light/dark themes and component styling.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, and InternetIdentityProvider.",
  "frontend/src/pages/AssignmentFormatPage.tsx": "Large page providing multilingual UI, assignment formatting controls, content editor, and download options.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing hero section and grid of navigation cards for all student tools.",
  "frontend/src/pages/LeaveApplicationPage.tsx": "Generates a formatted leave application letter from user inputs with copy-to-clipboard support.",
  "frontend/src/pages/NotesCleanerPage.tsx": "Cleans rough notes by formatting, capitalizing, and structuring them, with copy functionality.",
  "frontend/src/pages/RequestFeaturePage.tsx": "Form allowing users to submit feature requests with optional email via mutation hook.",
  "frontend/src/pages/ResumeBuilderPage.tsx": "Builds a simple resume from user-entered details and projects, generating copyable text output.",
  "frontend/src/pages/StudyPlannerPage.tsx": "Main Study Planner page handling task creation, viewing, sorting, guest mode, and integration with backend queries. Manages state, renders UI, and coordinates task operations like add, toggle, delete, and export.",
  "frontend/src/utils/studyPlannerDuration.ts": "Parses duration strings into minutes and formats minutes back into human‑readable duration strings. Supports minutes and fractional hours.",
  "frontend/src/utils/studyPlannerGuestStorage.ts": "Manages guest‑mode study tasks in localStorage, including load, save, add, toggle, delete, and clear operations. Handles ID generation and legacy task cleanup.",
  "frontend/src/utils/studyPlannerPdfExport.ts": "Generates a printable HTML document for tasks and opens it for PDF printing. Builds formatted task listings with summaries and styling.",
  "frontend/src/utils/studyPlannerSort.ts": "Provides deterministic sorting for tasks by date/time or by default creation order. Ensures stable ordering using task IDs.",
  "frontend/src/utils/studyPlannerTaskDateTime.ts": "Converts HTML date/time inputs into backend‑friendly formats and formats stored timestamps for display. Handles optional date and time fields safely.",
  "frontend/src/utils/studyPlannerTxtExport.ts": "Builds a plain‑text representation of tasks and triggers a downloadable .txt file. Includes headers, summaries, and task details.",
  "frontend/src/utils/subjectColorMapping.ts": "Maps subjects to predefined color names and CSS classes. Provides helpers for badge and indicator color selection based on subject.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters (including hash routes) and storing/retrieving them in sessionStorage, plus helpers for persisted parameters and hash cleanup.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with dark mode, custom colors, extended theme settings, keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the current project state and requirements for fixing the Daily tab progress bar rendering in the Study Planner.",
  "unknown.txt": "Outlines a fixed assignment editor format with features like downloads, auto-save, citation helpers, and an embedded 'Student Sathi Assistant' UI behavior specification."
}