{
  "backend/main.mo": "Main backend canister providing feature requests, user profiles, announcements, assignments, and study planner task types with access control and storage mixins.",
  "feature_evidence.json": "Empty feature evidence report structure with no features listed.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for all major frontend pages, components, hooks, and configs.",
  "frontend/.release/production-version.txt": "Stores the currently promoted production draft version number.",
  "frontend/.release/README.md": "Explains CI/CD promotion metadata usage and how production-version.txt controls live deployment.",
  "frontend/index.css": "Defines global Tailwind layers and OKLCH-based color tokens for light and dark themes.",
  "frontend/index.html": "Basic HTML entry file mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, and global toaster for the React app.",
  "frontend/src/components/AssignmentChatbot.tsx": "Advanced multilingual assignment chatbot with voice, OCR, image upload, and downloadable outputs.",
  "frontend/src/components/Layout.tsx": "Page layout with header navigation, mobile drawer menu, routed content outlet, and footer.",
  "frontend/src/components/StudentSathiAssistant.tsx": "Implements a chat-style assistant with voice input, OCR via Tesseract, auto-scrolling, and assignment generation/confirmation workflows.",
  "frontend/src/components/studyPlanner/DailyProgressChart.nochange.md": "Notes that DailyProgressChart.tsx must remain unchanged for weekly chart fixes.",
  "frontend/src/components/studyPlanner/DailyProgressChart.tsx": "Renders a daily study progress donut chart summarizing completed, pending tasks, and total study time.",
  "frontend/src/components/studyPlanner/ProgressChartsSection.tsx": "Wraps and switches between daily or weekly progress charts based on the selected view type.",
  "frontend/src/components/studyPlanner/SubjectBadge.tsx": "Displays a subject label with a color class computed from subject metadata.",
  "frontend/src/components/studyPlanner/SubjectFilterDropdown.tsx": "Provides a searchable dropdown to filter subjects and show counts, allowing selection or clearing.",
  "frontend/src/components/studyPlanner/WeeklyProgressChart.tsx": "Renders a weekly progress donut chart using completed tasks and total completed study time.",
  "frontend/src/components/UserGuidelineDocument.tsx": "Empty placeholder component file.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login/logout handling, identity persistence, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query mutations for feature requests, assignment generation, conversation saving, and study planner task operations, including topic extraction and confirmation helpers.",
  "frontend/src/hooks/useStudyPlannerSort.ts": "Stores and retrieves the study planner sort mode in localStorage with a simple setter.",
  "frontend/src/hooks/useStudyPlannerSubjectFilter.ts": "Manages daily and weekly subject filters separately and persists them in localStorage.",
  "frontend/src/hooks/useStudyPlannerView.ts": "Stores and restores the study planner view mode (daily or weekly) using localStorage.",
  "frontend/src/index.css": "Configures Tailwind base styles and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AssignmentFormatPage.tsx": "Implements a rich assignment formatting page with multilingual UI, editor features, and export options.",
  "frontend/src/pages/HomePage.tsx": "Displays the main dashboard with links to all tools and a hero section.",
  "frontend/src/pages/LeaveApplicationPage.tsx": "Generates a leave application letter from user input and supports copying the result.",
  "frontend/src/pages/NotesCleanerPage.tsx": "Provides a UI to input rough notes, process them into cleaned formatted text, and copy the result.",
  "frontend/src/pages/RequestFeaturePage.tsx": "Displays a form for users to submit feature requests with optional email, sending data via a mutation hook.",
  "frontend/src/pages/ResumeBuilderPage.tsx": "Lets users input personal details and projects to generate a simple text-based resume and copy it to the clipboard.",
  "frontend/src/pages/StudyPlannerPage.tsx": "A full study-planner interface handling tasks, filters, authentication, guest mode, sorting, and exporting.",
  "frontend/src/utils/studyPlannerDuration.ts": "Utility functions to parse human-readable durations into minutes and format minutes back into duration strings.",
  "frontend/src/utils/studyPlannerGuestStorage.ts": "Manages guest-mode study tasks in localStorage, including loading, saving, creating, updating, and deleting tasks.",
  "frontend/src/utils/studyPlannerPdfExport.ts": "Generates printable HTML for exporting study tasks and opens a print window to save as PDF. Builds styled task sections and summary info based on daily or weekly view.",
  "frontend/src/utils/studyPlannerSort.ts": "Provides deterministic sorting for study tasks by date/time or default ID order. Ensures stable ordering using timestamps and task IDs.",
  "frontend/src/utils/studyPlannerTaskDateTime.ts": "Converts and formats optional date/time fields for study tasks, including parsing HTML inputs and producing readable date-time strings. Handles bigint and number date formats safely.",
  "frontend/src/utils/studyPlannerTxtExport.ts": "Creates a plain‑text export of study tasks with headers, summaries, and task details, then downloads it as a .txt file. Formats date/time and optional priority fields.",
  "frontend/src/utils/studyPlannerWeek.ts": "Handles weekly date calculations, including unwrapping optional dates, normalizing bigint/number timestamps, and determining week boundaries. Provides helpers to check week membership and find weekday indices.",
  "frontend/src/utils/subjectColorMapping.ts": "Maps subjects to predefined color names and Tailwind CSS classes for badges and indicators. Exposes helpers to get persisted colors and corresponding class names.",
  "frontend/src/utils/urlParams.ts": "Parses URL and hash parameters, stores them in sessionStorage, and retrieves or clears them as needed. Supports persisted parameter handling with URL precedence.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended color system, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines project metadata for promoting draft version 73 to production and tracks a known UI issue with task strike‑through behavior.",
  "unknown.txt": "Describes the fixed assignment‑editor format and embedded Student Sathi Assistant UI behavior with editing tools, downloads, autosave, and chat features."
}