{
  "backend/main.mo": "Main backend actor managing feature requests, user profiles, announcements, study tasks, assignments, and access control with storage and authorization mixins.",
  "feature_evidence.json": "Feature evidence report listing implemented frontend features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their roles across pages, components, hooks, and configuration.",
  "frontend/index.css": "Global Tailwind CSS setup defining OKLCH color variables, dark mode overrides, and base styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading the main script.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, layout wrapper, and global toaster notifications.",
  "frontend/src/components/AssignmentChatbot.tsx": "Complex multi-language assignment chatbot with voice, OCR, file upload, message history, and downloadable outputs.",
  "frontend/src/components/Layout.tsx": "Defines the main page layout with header navigation, mobile drawer, routed content area, and footer.",
  "frontend/src/components/StudentSathiAssistant.tsx": "Implements an interactive assistant with messaging, voice input, OCR via Tesseract, and assignment-generation workflow.",
  "frontend/src/components/studyPlanner/SubjectBadge.tsx": "Renders a colored subject badge using mapped color classes.",
  "frontend/src/components/studyPlanner/SubjectFilterDropdown.tsx": "Provides a searchable dropdown for selecting subjects with counts and filtering support.",
  "frontend/src/components/UserGuidelineDocument.tsx": "Empty component file with no implemented content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to Internet Identity, with automatic refetching on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication and loading stored identities.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for feature requests, assignment generation logic, conversation saving, and study planner mutations.",
  "frontend/src/hooks/useStudyPlannerSort.ts": "Manages and persists the user's chosen study planner sort mode using localStorage.",
  "frontend/src/hooks/useStudyPlannerSubjectFilter.ts": "Provides a hook to store and retrieve subject filters for daily and weekly study planner views using localStorage.",
  "frontend/src/hooks/useStudyPlannerView.ts": "Provides a hook to persist and restore the study planner view mode (daily or weekly) using localStorage.",
  "frontend/src/index.css": "Defines global Tailwind CSS styles and theme variables for both light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AssignmentFormatPage.tsx": "Implements an assignment formatting tool with multilingual UI, text editing, formatting options, and AI-assisted improvements.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section and a grid of navigation cards linking to various tools.",
  "frontend/src/pages/LeaveApplicationPage.tsx": "Generates a leave application letter based on user inputs and supports copying the generated text.",
  "frontend/src/pages/NotesCleanerPage.tsx": "Cleans and formats rough notes into readable text and allows copying the processed output.",
  "frontend/src/pages/RequestFeaturePage.tsx": "A form page where users submit feature requests with optional email, using a mutation hook and toast notifications.",
  "frontend/src/pages/ResumeBuilderPage.tsx": "A resume builder UI that collects personal info, skills, and projects, then generates and copies a text-based resume.",
  "frontend/src/pages/StudyPlannerPage.tsx": "A full study planner interface supporting authenticated and guest tasks, task creation, sorting, filtering, and exporting.",
  "frontend/src/utils/studyPlannerDuration.ts": "Utilities to parse duration strings into minutes and format minutes back into readable duration text.",
  "frontend/src/utils/studyPlannerGuestStorage.ts": "LocalStorage-based CRUD utilities for managing guest study tasks with ID tracking and legacy cleanup.",
  "frontend/src/utils/studyPlannerPdfExport.ts": "Generates printable HTML for study tasks and opens it in a new window for PDF-style printing.",
  "frontend/src/utils/studyPlannerSort.ts": "Deterministic sorting helpers for study tasks, supporting default and date/time ordering.",
  "frontend/src/utils/studyPlannerTaskDateTime.ts": "Provides utilities to convert date/time inputs to backend-friendly formats and format stored task dates and times for display.",
  "frontend/src/utils/studyPlannerTxtExport.ts": "Generates a clean TXT export of study tasks with headers, summaries, per-task details, and triggers file download.",
  "frontend/src/utils/subjectColorMapping.ts": "Defines subject-to-color mappings and returns badge and indicator color classes based on subject or persisted color.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and retrieving or clearing stored values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, radius, shadows, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the project state, scope, and requirements for enhancing subject filter persistence and search with task counts.",
  "unknown.txt": "Outlines fixed assignment format features, editor behavior, helper tools, and UI rules for the Student Sathi Assistant module."
}