{
  "kind": "build_request",
  "title": "Add Daily view progress bar in Study Planner (match Weekly)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In `frontend/src/pages/StudyPlannerPage.tsx`, add a progress bar to the **Daily** view that matches the existing **Weekly** progress bar style exactly, and place it directly under the \"Your Daily Study Tasks\" heading and above the daily task list, without moving any existing buttons or changing spacing/layout elsewhere.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "ADD DAILY PROGRESS BAR (NO OTHER CHANGES)\n\nGOAL:\nShow progress bar in DAILY view same as WEEKLY view.\n\nWHAT TO ADD:\n1) Add a progress bar in \"Daily\" tab.\n2) Position it EXACTLY under:\n   \"Your Daily Study Tasks\" heading\n   and ABOVE the daily task list.\n3) Progress calculation:\n   (Completed daily tasks / Total daily tasks) × 100\n4) Progress bar style MUST match weekly progress bar.\n\nSTRICT RULES:\n- Do NOT move any existing buttons.\n- Do NOT change layout spacing.\n- Do NOT resize task cards.\n- Do NOT affect weekly progress bar.\n- Do NOT touch summary card.\n- Do NOT change colors, fonts, or icons.\n- Do NOT add new sections.\n\nIMPORTANT:\n- Daily progress shows ONLY daily tasks.\n- Weekly progress shows ONLY weekly tasks.\n- Both must work independently."
        ]
      },
      "acceptanceCriteria": [
        "When the Daily tab is selected, a progress bar is visible directly under the \"Your Daily Study Tasks\" heading and above the daily task list.",
        "Daily progress percent is computed as (completed daily tasks / total daily tasks) × 100 (0% when there are 0 daily tasks).",
        "The Daily progress bar styling (colors, size, typography, spacing) matches the existing Weekly progress bar exactly.",
        "Daily progress only reflects Daily tasks; Weekly progress only reflects Weekly tasks; switching tabs updates each independently.",
        "No existing buttons move position; task card sizes remain unchanged; no spacing/layout shifts occur outside the added Daily progress bar element.",
        "The Weekly progress bar remains unchanged in appearance and behavior.",
        "The summary card remains untouched."
      ]
    }
  ],
  "constraints": [
    "Make no changes other than adding the Daily progress bar.",
    "Do not move any existing buttons.",
    "Do not change layout spacing.",
    "Do not resize task cards.",
    "Do not affect the Weekly progress bar implementation or UI.",
    "Do not touch the summary card.",
    "Do not change colors, fonts, or icons.",
    "Do not add new sections.",
    "If any layout shifts or UI breaks, rollback and reapply only this change."
  ],
  "nonGoals": [
    "Backend changes (no Motoko changes required).",
    "Changing progress bar design or introducing a new progress bar style.",
    "Adding new dashboard/summary sections or altering existing Study Planner structure."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}