{
  "kind": "build_request",
  "title": "Study Planner: Persist subject filter per view + add in-dropdown search and per-mode task counts (no layout changes)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Persist and restore the last selected subject filter in the Study Planner task list, using localStorage, without changing any existing layout/structure.\n\nDetails:\n- When a user selects a subject in the subject-wise filter dropdown (task list filter), save it to localStorage.\n- On page reload, restore and apply the saved subject filter.\n- When switching Daily ↔ Weekly views, automatically restore and apply the last selected subject for the newly active view.\n- Daily and Weekly must persist independently (e.g., separate storage keys per view).\n- If no saved subject exists for a view, keep the current default behavior unchanged.\n- Initialize the filter state synchronously from storage (like `useStudyPlannerView`) to avoid flicker/re-render jumps.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "REMEMBER LAST SELECTED SUBJECT FILTER\n   - When a user selects a subject from the filter dropdown,\n     store the selected value in local storage (or equivalent persistent state)\n   - On page reload OR when switching between Daily ↔ Weekly views,\n     automatically restore and apply the last selected subject\n   - If no subject was previously selected, default behavior remains unchanged\n   - This must work independently for Daily and Weekly modes if applicable"
        ]
      },
      "acceptanceCriteria": [
        "Selecting a subject in Daily view, switching to Weekly and back to Daily keeps the Daily subject selection unchanged and applied.",
        "Selecting a subject in Weekly view, switching to Daily and back to Weekly keeps the Weekly subject selection unchanged and applied.",
        "Refreshing the page restores the previously selected subject filter for the currently active view (Daily or Weekly).",
        "No visual flicker or layout shift occurs when restoring the saved subject filter (state initialized from localStorage synchronously).",
        "No changes to grid, spacing, card sizes, or section positions (progress bar, summary cards, and task list remain exactly where they are)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Enhance the existing subject-wise filter dropdown in the Study Planner task list to support in-dropdown search and show per-subject task counts, without increasing dropdown width or changing layout.\n\nDetails:\n- Add a search input inside the dropdown content that filters the subject options by name as the user types.\n- Render each subject option with a count badge in the label, formatted exactly like: `Math (5)`.\n- Task counts must reflect the currently active mode (Daily or Weekly), i.e., computed from the tasks belonging to the active view.\n- Filtering interactions must feel instant and smooth, with no flicker.\n- Keep the existing task list rendering logic unchanged (only enhance the filter control and how it selects/applies the filter).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "2. SEARCH + SUBJECT COUNT IN FILTER DROPDOWN\n   - Add a search input inside the subject filter dropdown\n     to allow users to quickly search subjects by name\n   - Display subject names with task count badges, e.g.:\n       Math (5)\n       Physics (2)\n   - Counts must reflect the currently active mode (Daily or Weekly)\n   - This enhancement must not increase dropdown width or affect layout\n\nUX RULES:\n- Filtering must feel instant and smooth\n- No visual flicker or re-render jumps\n- Existing task list rendering logic must remain unchanged"
        ]
      },
      "acceptanceCriteria": [
        "Opening the subject filter dropdown shows a search input within the dropdown content.",
        "Typing in the search input filters the visible subject options by name without changing dropdown width or causing layout shift.",
        "Each subject option displays the subject name plus the correct task count for the currently active view (Daily or Weekly) in the option label (e.g., `Physics (2)`).",
        "Switching Daily ↔ Weekly updates the counts shown in the dropdown to match the active view.",
        "No changes to the positioning of the progress bar, summary cards, or task list; no new page sections/wrappers are introduced."
      ]
    }
  ],
  "constraints": [
    "Do not modify UI layout, grid, spacing, card height/width, or section positions.",
    "Do not move the progress bar, summary cards, or task list.",
    "Do not add new sections or wrappers; only enhance the existing filter behavior and controls.",
    "Filtering must feel instant and smooth with no visual flicker or re-render jumps.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not change backend APIs or data models for this upgrade.",
    "Do not change task card rendering, sorting behavior, or progress bar computation/placement beyond applying the existing subject filter.",
    "Do not add new Study Planner sections, panels, or reorganize the page."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}