{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Daily progress bar in Study Planner (match Weekly)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a Daily-view progress bar in StudyPlannerPage positioned under the \"Your Daily Study Tasks\" heading, matching the existing Weekly progress bar styling and calculating percent from Daily tasks only.",
      "acceptanceCriteria": [
        "When the Daily tab is selected, a progress bar is visible directly under the \"Your Daily Study Tasks\" heading and above the daily task list.",
        "Daily progress percent is computed as (completed daily tasks / total daily tasks) × 100 (0% when there are 0 daily tasks).",
        "The Daily progress bar styling (colors, size, typography, spacing) matches the existing Weekly progress bar exactly.",
        "Daily progress only reflects Daily tasks; Weekly progress only reflects Weekly tasks; switching tabs updates each independently.",
        "No existing buttons move position; task card sizes remain unchanged; no spacing/layout shifts occur outside the added Daily progress bar element.",
        "The Weekly progress bar remains unchanged in appearance and behavior.",
        "The summary card remains untouched."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/StudyPlannerPage.tsx",
          "operation": "modify",
          "description": "In the Task List CardHeader section, insert a new progress bar block that renders only when currentView === 'daily', placing it immediately after the CardTitle (\"Your Daily Study Tasks\") and before the task list content. Duplicate the existing Weekly progress bar JSX/CSS classes exactly (including any percent label/typography) to ensure identical styling, using the same computed percent logic for the currently filtered daily tasks (0% when total is 0). Use the shadcn-ui Progress component already imported from '@/components/ui/progress' to render the bar. Verify the component's usage instructions before implementing. Ensure no other UI/layout changes: do not move the existing header buttons (sort/clear/export), do not alter spacing elsewhere, do not change the Weekly progress bar block, and do not touch the summary card."
        }
      ]
    }
  ]
}