{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Study Planner: per-view persisted subject filter + searchable subject dropdown with per-mode counts",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Persist and restore the task-list subject filter independently for Daily and Weekly views using synchronous localStorage initialization to avoid flicker, without changing layout.",
      "acceptanceCriteria": [
        "Selecting a subject in Daily view, switching to Weekly and back to Daily keeps the Daily subject selection unchanged and applied.",
        "Selecting a subject in Weekly view, switching to Daily and back to Weekly keeps the Weekly subject selection unchanged and applied.",
        "Refreshing the page restores the previously selected subject filter for the currently active view (Daily or Weekly).",
        "No visual flicker or layout shift occurs when restoring the saved subject filter (state initialized from localStorage synchronously).",
        "No changes to grid, spacing, card sizes, or section positions (progress bar, summary cards, and task list remain exactly where they are)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useStudyPlannerSubjectFilter.ts",
          "operation": "create",
          "description": "Create a dedicated hook that mirrors the synchronous localStorage initialization pattern used by useStudyPlannerView, but for the Study Planner task-list subject filter; store Daily and Weekly selections independently via separate storage keys and expose a simple API keyed by the active view to support instant restore on view switch (no flicker)."
        },
        {
          "path": "frontend/src/pages/StudyPlannerPage.tsx",
          "operation": "modify",
          "description": "Wire the new per-view subject-filter persistence into the existing Study Planner task list filter: (1) initialize subject filter state synchronously from localStorage for the active view, (2) persist updates on selection changes, (3) on Daily↔Weekly switch, restore and apply the last subject selection for the newly active view, and (4) apply the selected subject filter to the existing task list filtering pipeline without altering any layout/structure or task card rendering logic."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Enhance the existing task-list subject filter dropdown with in-dropdown search and per-subject task counts for the active mode (Daily/Weekly) while keeping dropdown width and page layout unchanged.",
      "acceptanceCriteria": [
        "Opening the subject filter dropdown shows a search input within the dropdown content.",
        "Typing in the search input filters the visible subject options by name without changing dropdown width or causing layout shift.",
        "Each subject option displays the subject name plus the correct task count for the currently active view (Daily or Weekly) in the option label (e.g., `Physics (2)`).",
        "Switching Daily ↔ Weekly updates the counts shown in the dropdown to match the active view.",
        "No changes to the positioning of the progress bar, summary cards, or task list; no new page sections/wrappers are introduced."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/studyPlanner/SubjectFilterDropdown.tsx",
          "operation": "create",
          "description": "Implement a focused subject-filter dropdown component that preserves the current trigger sizing/width while adding (a) an input inside the dropdown content for searching subjects by name and (b) option labels that include active-mode task counts formatted exactly as `Subject (N)`. Use shadcn-ui primitives (e.g., Select/Popover/Command/Input as appropriate) to keep styling consistent; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/StudyPlannerPage.tsx",
          "operation": "modify",
          "description": "Replace/enhance the existing task-list subject filter control by wiring in SubjectFilterDropdown while keeping the surrounding markup, spacing, and widths unchanged: compute per-subject counts from the tasks belonging to the currently active view (Daily/Weekly), pass counts + current selection + selection handler to the dropdown, and ensure search/filter interactions are instant with no flicker; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}