{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Weekly Progress Chart to compute current-week stats from live task data",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Correct Weekly Progress Chart calculations to derive counts and total time from the same live tasks array as Daily Progress Chart, filtered to the current local week (Mon–Sun) with proper backend/guest date normalization and completed-time aggregation.",
      "acceptanceCriteria": [
        "With at least one task dated within the current week, Weekly Progress Chart no longer shows static 0 values and displays correct Total/Completed/Pending counts.",
        "Weekly Progress Chart total time equals the sum of durations for completed tasks within the current week only (pending tasks do not contribute to total time).",
        "Weekly Progress Chart filtering uses Monday as the start of week and Sunday as the end of week (local time).",
        "Weekly Progress Chart updates immediately after: adding a task, deleting a task, toggling completion on/off, without requiring a page refresh.",
        "Daily Progress Chart logic remains unchanged.",
        "Weekly Summary section remains unchanged, including its calculations and UI.",
        "No visual/UI changes occur in Weekly Progress Chart other than the numbers updating correctly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/studyPlanner/WeeklyProgressChart.tsx",
          "operation": "modify",
          "description": "Update weekly stats derivation to: (1) compute currentWeekTasks by filtering the provided tasks prop to the current week using task.date normalized to a Date; (2) unwrap backend optional date shapes (e.g., [] | [Time]) before calling normalizeTaskDate while still supporting guest number | undefined dates; (3) bind Total/Completed/Pending counts to currentWeekTasks-derived values; (4) compute weekly total time by summing parseDurationToMinutes(duration) for completed tasks in currentWeekTasks only, then format with formatMinutesToDuration; (5) keep all calculations derived directly from tasks with correct useMemo dependencies so updates happen immediately after add/delete/toggle. Do not change any UI, colors, layout, or text."
        }
      ]
    }
  ]
}